Repository: Kevin-hDev/ChillShell
Catalog: lib/l10n/app_*.arb
Languages: de, fr, zh

source: Settings
de: Einstellungen
fr: Paramètres
zh: 设置

source: Connection
de: Verbindung
fr: Connexion
zh: 连接

source: Access
de: Zugang
fr: Accès
zh: 访问

source: General
de: Allgemein
fr: Général
zh: 通用

source: Security
de: Sicherheit
fr: Sécurité
zh: 安全

source: Remote Access
de: Fernzugriff
fr: Accès distant
zh: 远程访问

# tailscaleDescription
source: Connect to your PC from anywhere in the world
de: Verbinden Sie sich von überall auf der Welt mit Ihrem PC
fr: Connectez-vous à votre PC de n'importe où dans le monde
zh: 从世界任何地方连接到您的电脑

source: Website
de: Webseite
fr: Site web
zh: 网站

# noSshKeys
source: No SSH keys. Create one to connect.
de: Keine SSH-Schlüssel. Erstellen Sie einen, um sich zu verbinden.
fr: Aucune clé SSH. Créez-en une pour vous connecter.
zh: 没有SSH密钥。创建一个以连接。

source: Theme
de: Thema
fr: Thème
zh: 主题

source: Language
de: Sprache
fr: Langue
zh: 语言

source: Font size
de: Schriftgröße
fr: Taille de police
zh: 字体大小

source: Disconnect
de: Trennen
fr: Déconnecter
zh: 断开

# disconnectConfirmTitle
source: Disconnect
de: Trennen
fr: Déconnexion
zh: 断开连接

# disconnectConfirmMessage
source: Do you want to close all SSH connections?
de: Möchten Sie alle SSH-Verbindungen schließen?
fr: Voulez-vous fermer toutes les connexions SSH ?
zh: 是否关闭所有SSH连接？

source: Connect
de: Verbinden
fr: Connecter
zh: 连接

source: Cancel
de: Abbrechen
fr: Annuler
zh: 取消

source: Save
de: Speichern
fr: Enregistrer
zh: 保存

source: Delete
de: Löschen
fr: Supprimer
zh: 删除

source: Add
de: Hinzufügen
fr: Ajouter
zh: 添加

source: Retry
de: Wiederholen
fr: Réessayer
zh: 重试

source: No connection
de: Keine Verbindung
fr: Aucune connexion
zh: 无连接

# connectToServer
source: Connect to an SSH server
de: Mit SSH-Server verbinden
fr: Connectez-vous à un serveur SSH
zh: 连接到SSH服务器

source: New connection
de: Neue Verbindung
fr: Nouvelle connexion
zh: 新建连接

# connectionInProgress
source: Connecting...
de: Verbindung wird hergestellt...
fr: Connexion en cours...
zh: 正在连接...

source: Reconnecting...
de: Wiederverbinden...
fr: Reconnexion...
zh: 正在重连...

source: Connection error
de: Verbindungsfehler
fr: Erreur de connexion
zh: 连接错误

source: Reconnect
de: Wiederverbinden
fr: Reconnecter
zh: 重新连接

source: Run commands
de: Befehle ausführen
fr: Exécuter des commandes
zh: 运行命令

source: Local Shell
de: Lokale Shell
fr: Shell local
zh: 本地Shell

# localShellNotAvailable
source: Not available on iOS
de: Nicht verfügbar auf iOS
fr: Non disponible sur iOS
zh: iOS不可用

# localShellIOSMessage
source: iOS does not allow local shell access. SSH connections work normally.
de: iOS erlaubt keinen lokalen Shell-Zugriff. SSH-Verbindungen funktionieren normal.
fr: iOS ne permet pas l'accès au shell local. Les connexions SSH fonctionnent normalement.
zh: iOS不允许访问本地Shell。SSH连接正常工作。

source: Copy
de: Kopieren
fr: Copier
zh: 复制

source: Paste
de: Einfügen
fr: Coller
zh: 粘贴

source: SSH Keys
de: SSH-Schlüssel
fr: Clés SSH
zh: SSH密钥

source: Create SSH Key
de: SSH-Schlüssel erstellen
fr: Créer une clé SSH
zh: 创建SSH密钥

source: Import Key
de: Schlüssel importieren
fr: Importer une clé
zh: 导入密钥

# importKeySubtitle
source: .pem file or private key
de: .pem-Datei oder privater Schlüssel
fr: Fichier .pem ou clé privée
zh: .pem文件或私钥

# selectFile
source: Select a file
de: Datei auswählen
fr: Sélectionner un fichier
zh: 选择文件

# orPasteKey
source: Or paste the key:
de: Oder Schlüssel einfügen:
fr: Ou collez la clé :
zh: 或粘贴密钥：

source: Key name
de: Schlüsselname
fr: Nom de la clé
zh: 密钥名称

source: Public key
de: Öffentlicher Schlüssel
fr: Clé publique
zh: 公钥

source: Private key
de: Privater Schlüssel
fr: Clé privée
zh: 私钥

# keyCopied
source: Key copied to clipboard
de: Schlüssel in Zwischenablage kopiert
fr: Clé copiée dans le presse-papiers
zh: 密钥已复制到剪贴板

source: Delete key
de: Schlüssel löschen
fr: Supprimer la clé
zh: 删除密钥

source: Saved connections
de: Gespeicherte Verbindungen
fr: Connexions sauvegardées
zh: 已保存的连接

source: Auto connection
de: Automatische Verbindung
fr: Connexion automatique
zh: 自动连接

source: Host
fr: Hôte
zh: 主机

source: Username
de: Benutzername
fr: Utilisateur
zh: 用户名

source: Select key
de: Schlüssel auswählen
fr: Sélectionner une clé
zh: 选择密钥

source: Save connection
de: Verbindung speichern
fr: Enregistrer la connexion
zh: 保存连接

source: Delete connection
de: Verbindung löschen
fr: Supprimer la connexion
zh: 删除连接

source: Unlock
de: Entsperrung
fr: Déverrouillage
zh: 解锁

source: PIN Code
fr: Code PIN
zh: PIN码

# createPin
source: Create your PIN
de: PIN erstellen
fr: Créer votre code PIN
zh: 创建PIN码

# confirmPin
source: Confirm your PIN
de: PIN bestätigen
fr: Confirmer votre code PIN
zh: 确认PIN码

# enterPin
source: Enter your PIN
de: PIN eingeben
fr: Entrez votre code PIN
zh: 输入PIN码

# pinMismatch
source: PINs do not match
de: PINs stimmen nicht überein
fr: Les codes PIN ne correspondent pas
zh: PIN码不匹配

source: Wrong PIN
de: Falscher PIN
fr: Code PIN incorrect
zh: PIN码错误

source: Fingerprint
de: Fingerabdruck
fr: Empreinte digitale
zh: 指纹

# fingerprintUnavailable
source: No fingerprint registered on this device
de: Kein Fingerabdruck auf diesem Gerät registriert
fr: Aucune empreinte enregistrée sur cet appareil
zh: 此设备未注册指纹

source: Auto-lock
de: Automatische Sperre
fr: Verrouillage auto
zh: 自动锁定

source: Auto-lock time
de: Sperrzeit
fr: Temps de verrouillage
zh: 锁定时间

# clearHistory
source: Clear command history
de: Verlauf löschen
fr: Effacer l'historique
zh: 清除历史

# clearHistoryConfirm
source: Delete all command history?
de: Gesamten Befehlsverlauf löschen?
fr: Supprimer tout l'historique des commandes ?
zh: 删除所有命令历史？

source: History cleared
de: Verlauf gelöscht
fr: Historique effacé
zh: 历史已清除

# wolEnabled
source: Wake-on-LAN enabled
de: Wake-on-LAN aktiviert
fr: Wake-on-LAN activé
zh: 启用网络唤醒

# wolConfigs
source: WOL configurations
de: WOL-Konfigurationen
fr: Configurations WOL
zh: WOL配置

# addWolConfig
source: Add WOL configuration
de: WOL-Konfiguration hinzufügen
fr: Ajouter une configuration WOL
zh: 添加WOL配置

source: MAC address
de: MAC-Adresse
fr: Adresse MAC
zh: MAC地址

source: Broadcast address
de: Broadcast-Adresse
fr: Adresse de diffusion
zh: 广播地址

# pressKeyForCtrl
source: Press a key...
de: Taste drücken...
fr: Appuyez sur une lettre...
zh: 按下一个键...

# wolWakingUp
source: Waking up {name}...
de: {name} wird aufgeweckt...
fr: Réveil de {name} en cours...
zh: 正在唤醒 {name}...

# wolAttempt
source: Attempt {attempt}/{maxAttempts}
de: Versuch {attempt}/{maxAttempts}
fr: Tentative {attempt}/{maxAttempts}
zh: 尝试 {attempt}/{maxAttempts}

# wolConnected
source: Connected!
de: Verbunden!
fr: Connecté !
zh: 已连接！

# wolPcAwake
source: {name} is awake
de: {name} ist wach
fr: {name} allumé
zh: {name} 已唤醒

# wolSshEstablished
source: SSH connection established
de: SSH-Verbindung hergestellt
fr: Connexion SSH établie
zh: SSH连接已建立

source: Back
de: Zurück
fr: Retour
zh: 返回

# addPc
source: Add a PC
de: PC hinzufügen
fr: Ajouter un PC
zh: 添加电脑

source: PC name
fr: Nom du PC
zh: 电脑名称

# pcNameRequired
source: Name is required
de: Name ist erforderlich
fr: Le nom est obligatoire
zh: 名称为必填项

# macAddressRequired
source: MAC address is required
de: MAC-Adresse ist erforderlich
fr: L'adresse MAC est obligatoire
zh: MAC地址为必填项

# macAddressInvalid
source: Invalid format (e.g. AA:BB:CC:DD:EE:FF)
de: Ungültiges Format (z.B. AA:BB:CC:DD:EE:FF)
fr: Format invalide (ex: AA:BB:CC:DD:EE:FF)
zh: 格式无效（例如 AA:BB:CC:DD:EE:FF）

# howToFindMac
source: How to find the MAC address?
de: Wie finde ich die MAC-Adresse?
fr: Comment trouver l'adresse MAC ?
zh: 如何查找MAC地址？

source: Linked SSH connection *
de: Verknüpfte SSH-Verbindung *
fr: Connexion SSH associée *
zh: 关联的SSH连接 *

# selectConnection
source: Select a connection
de: Verbindung auswählen
fr: Sélectionner une connexion
zh: 选择连接

source: No saved connections
de: Keine gespeicherten Verbindungen
fr: Aucune connexion sauvegardée
zh: 没有已保存的连接

# pleaseSelectSshConnection
source: Please select an SSH connection
de: Bitte wählen Sie eine SSH-Verbindung
fr: Veuillez sélectionner une connexion SSH
zh: 请选择一个SSH连接

# configAdded
source: Configuration "{name}" added
de: Konfiguration "{name}" hinzugefügt
fr: Configuration "{name}" ajoutée
zh: 配置 "{name}" 已添加

source: Find MAC address
de: MAC-Adresse finden
fr: Trouver l'adresse MAC
zh: 查找MAC地址

# macAddressFormat
source: MAC address looks like: AA:BB:CC:DD:EE:FF
de: MAC-Adresse sieht so aus: AA:BB:CC:DD:EE:FF
fr: L'adresse MAC ressemble à : AA:BB:CC:DD:EE:FF
zh: MAC地址格式：AA:BB:CC:DD:EE:FF

source: Understood
de: Verstanden
fr: Compris
zh: 明白了

source: QUICK CONNECTIONS
de: SCHNELLVERBINDUNGEN
fr: CONNEXIONS RAPIDES
zh: 快速连接

# autoConnectOnStart
source: Auto-connect on startup
de: Automatisch beim Start verbinden
fr: Connexion auto au démarrage
zh: 启动时自动连接

# autoConnectOnStartDesc
source: Automatically connect to the last connection
de: Automatisch mit der letzten Verbindung verbinden
fr: Se connecter automatiquement à la dernière connexion
zh: 自动连接到上次的连接

source: Auto reconnect
de: Automatisch wiederverbinden
fr: Reconnexion automatique
zh: 自动重连

# autoReconnectDesc
source: Reconnect if connection is lost
de: Bei Verbindungsverlust wiederverbinden
fr: Reconnecter en cas de perte de connexion
zh: 连接丢失时自动重连

source: Disconnect notification
de: Trennungsbenachrichtigung
fr: Notification de déconnexion
zh: 断开通知

# disconnectNotificationDesc
source: Show notification on disconnection
de: Benachrichtigung bei Trennung anzeigen
fr: Afficher une notification en cas de déconnexion
zh: 断开时显示通知

# deleteConnectionConfirm
source: Delete connection?
de: Verbindung löschen?
fr: Supprimer la connexion ?
zh: 删除连接？

# deleteConnectionConfirmMessage
source: Do you want to delete "{name}" from your saved connections?
de: Möchten Sie "{name}" aus Ihren gespeicherten Verbindungen löschen?
fr: Voulez-vous supprimer "{name}" de vos connexions sauvegardées ?
zh: 是否从已保存的连接中删除 "{name}"？

# noWolConfig
source: No configuration. Add one to enable WOL.
de: Keine Konfiguration. Fügen Sie eine hinzu, um WOL zu aktivieren.
fr: Aucune configuration. Ajoutez-en une pour activer le WOL.
zh: 暂无配置。添加一个以启用WOL。

# configRequired
source: Configuration required
de: Konfiguration erforderlich
fr: Configuration requise
zh: 需要配置

# wolDescription
source: Wake-on-LAN lets you turn on your PC from the app.
de: Wake-on-LAN ermöglicht das Einschalten Ihres PCs über die App.
fr: Le Wake-on-LAN permet d'allumer votre PC depuis l'app.
zh: Wake-on-LAN允许您从应用程序启动电脑。

# turnOnCableRequired
source: Turn on: Ethernet cable required
de: Einschalten: Ethernet-Kabel erforderlich
fr: Allumer : câble Ethernet requis
zh: 开机：需要以太网电缆

source: Turn off: WiFi or cable
de: Ausschalten: WiFi oder Kabel
fr: Éteindre : WiFi ou câble
zh: 关机：WiFi或电缆

source: Full guide
de: Vollständige Anleitung
fr: Guide complet
zh: 完整指南

source: Link copied
de: Link kopiert
fr: Lien copié
zh: 链接已复制

# wakeUpPc
source: Wake up a PC
de: PC aufwecken
fr: Allumer un PC
zh: 唤醒电脑

# connectionLostSnack
source: Connection lost
de: Verbindung verloren
fr: Connexion perdue
zh: 连接丢失

# unableToCreateTab
source: Unable to create a new tab
de: Tab konnte nicht erstellt werden
fr: Impossible de créer un nouvel onglet
zh: 无法创建新标签页

source: Private key not found
de: Privater Schlüssel nicht gefunden
fr: Clé privée introuvable
zh: 未找到私钥

source: Uploading image...
de: Bild wird hochgeladen...
fr: Envoi de l'image...
zh: 正在上传图片...

# uploadFailed
source: Image upload failed
de: Bild-Upload fehlgeschlagen
fr: Échec de l'envoi de l'image
zh: 图片上传失败

# errorMessage
source: Error: {error}
de: Fehler: {error}
fr: Erreur : {error}
zh: 错误：{error}

source: Invalid key format
de: Ungültiges Schlüsselformat
fr: Format de clé invalide
zh: 密钥格式无效

# keyFileTooLarge
source: File too large (max 16 KB). SSH keys should be small files.
de: Datei zu groß (max. 16 KB). SSH-Schlüssel sind kleine Dateien.
fr: Fichier trop volumineux (max 16 Ko). Les clés SSH sont de petits fichiers.
zh: 文件过大（最大 16 KB）。SSH 密钥应该是小文件。

# keyImported
source: Key "{name}" imported
de: Schlüssel "{name}" importiert
fr: Clé "{name}" importée
zh: 密钥 "{name}" 已导入

# deleteKeyConfirmTitle
source: Delete key?
de: Schlüssel löschen?
fr: Supprimer la clé ?
zh: 删除密钥？

# actionIrreversible
source: This action is irreversible.
de: Diese Aktion ist unwiderruflich.
fr: Cette action est irréversible.
zh: 此操作不可撤销。

# deleteKeysConfirm
source: Delete {count} key(s)?
de: {count} Schlüssel löschen?
fr: Supprimer {count} clé(s) ?
zh: 删除 {count} 个密钥？

# deleteConnectionsConfirm
source: Delete {count} connection(s)?
de: {count} Verbindung(en) löschen?
fr: Supprimer {count} connexion(s) ?
zh: 删除 {count} 个连接？

# deleteWolConfigsConfirm
source: Delete {count} config(s)?
de: {count} Konfiguration(en) löschen?
fr: Supprimer {count} config(s) ?
zh: 删除 {count} 个配置？

# sshKeyHostLabel
source: Host: {host}
fr: Hôte : {host}
zh: 主机：{host}

# sshKeyLastUsedLabel
source: Last used: {date}
de: Letzte Verwendung: {date}
fr: Dernière utilisation : {date}
zh: 最近使用：{date}

# shutdownPcTitle
source: Shutdown PC
de: PC herunterfahren
fr: Éteindre le PC
zh: 关闭电脑

# shutdownPcMessage
source: Do you really want to shutdown {name}? SSH connection will be closed.
de: Möchten Sie {name} wirklich herunterfahren? Die SSH-Verbindung wird geschlossen.
fr: Voulez-vous vraiment éteindre {name} ? La connexion SSH sera fermée.
zh: 确定要关闭 {name} 吗？ SSH连接将断开。

# shutdownAction
source: Shutdown
de: Herunterfahren
fr: Éteindre
zh: 关闭

# searchPlaceholder
source: Search...
de: Suchen...
fr: Rechercher...
zh: 搜索...

# wolBiosEnablePcie
source: Enable "Power On By PCI-E"
de: "Power On By PCI-E" aktivieren
fr: Activer "Power On By PCI-E"
zh: 启用 "Power On By PCI-E"

# wolBiosDisableErp
source: Disable "ErP Ready"
de: "ErP Ready" deaktivieren
fr: Désactiver "ErP Ready"
zh: 禁用 "ErP Ready"

# wolFastStartupTitle
source: 2. Fast Startup
de: 2. Schnellstart
fr: 2. Démarrage rapide
zh: 2. 快速启动

# wolFastStep1
source: Power Options → System Settings
de: Energieoptionen → Systemeinstellungen
fr: Options d'alimentation → Paramètre système
zh: 电源选项 → 系统设置

# wolFastStep2
source: Change unavailable settings
de: Nicht verfügbare Einstellungen ändern
fr: Modifier les paramètres non disponibles
zh: 更改不可用的设置

# wolFastStep3
source: Uncheck "Turn on fast startup"
de: "Schnellstart aktivieren" deaktivieren
fr: Décocher "Activer le démarrage rapide"
zh: 取消勾选"启用快速启动"

# wolDeviceManagerTitle
source: 3. Device Manager
de: 3. Geräte-Manager
fr: 3. Gestionnaire de périphériques
zh: 3. 设备管理器

# wolDevStep1
source: Network adapter → Power Management
de: Netzwerkadapter → Energieverwaltung
fr: Carte réseau → Gestion alimentation
zh: 网络适配器 → 电源管理

# wolDevStep2
source: Check "Magic Packet only"
de: "Nur Magic Packet" aktivieren
fr: Cocher "Paquet magique uniquement"
zh: 勾选"仅限魔术数据包"

# wolDevStep3
source: Network adapter → Advanced
de: Netzwerkadapter → Erweitert
fr: Carte réseau → Avancé
zh: 网络适配器 → 高级

# wolDevStep4
source: Enable "Wake on Magic Packet"
de: "Wake on Magic Packet" aktivieren
fr: Activer "Wake on Magic Packet"
zh: 启用 "Wake on Magic Packet"

# wolMacStep1
source: 1. Apple Menu → System Preferences
de: 1. Apple-Menü → Systemeinstellungen
fr: 1. Menu Apple → Préférences Système
zh: 1. Apple菜单 → 系统偏好设置

# wolMacStep2
source: 2. Energy Saver
de: 2. Energie sparen
fr: 2. Économiseur d'énergie
zh: 2. 节能

# wolMacStep3
source: 3. Check "Wake for network access"
de: 3. "Für Netzwerkzugriff reaktivieren" aktivieren
fr: 3. Cocher "Réactiver pour l'accès au réseau"
zh: 3. 勾选"唤醒以进行网络访问"

# sshKeySecurityTitle
source: Protect your keys
de: Ihre Schlüssel schützen
fr: Protéger vos clés
zh: 保护您的密钥

# sshKeySecurityDesc
source: Your SSH keys work like passwords that give access to your servers. The private key must NEVER be shared — not by email, messaging, or cloud storage. Only share the public key with servers you want to connect to. ChillShell stores your keys securely on your device only. If you suspect a key has been compromised, delete it immediately and create a new one.
de: Ihre SSH-Schlüssel funktionieren wie Passwörter, die Zugang zu Ihren Servern gewähren. Der private Schlüssel darf NIEMALS geteilt werden — nicht per E-Mail, Messenger oder Cloud-Speicher. Teilen Sie nur den öffentlichen Schlüssel mit den Servern, mit denen Sie sich verbinden möchten. ChillShell speichert Ihre Schlüssel sicher und ausschließlich auf Ihrem Gerät. Wenn Sie vermuten, dass ein Schlüssel kompromittiert wurde, löschen Sie ihn sofort und erstellen Sie einen neuen.
fr: Vos clés SSH fonctionnent comme des mots de passe qui donnent accès à vos serveurs. La clé privée ne doit JAMAIS être partagée — ni par email, messagerie, ni stockée dans le cloud. Partagez uniquement la clé publique avec les serveurs auxquels vous souhaitez vous connecter. ChillShell stocke vos clés de manière sécurisée uniquement sur votre appareil. Si vous suspectez qu'une clé a été compromise, supprimez-la immédiatement et créez-en une nouvelle.
zh: 您的SSH密钥就像密码，可以授予您服务器的访问权限。私钥绝对不能分享——不能通过邮件、即时通讯或云存储。只将公钥分享给您要连接的服务器。ChillShell仅在您的设备上安全存储密钥。如果您怀疑密钥已被泄露，请立即删除并创建新的密钥。

# sshHostKeyTitle
source: New server
de: Neuer Server
fr: Nouveau serveur
zh: 新服务器

# sshHostKeyMessage
source: You are connecting to {host} for the first time. Verify the server fingerprint before connecting:
de: Sie verbinden sich zum ersten Mal mit {host}. Überprüfen Sie den Server-Fingerabdruck vor dem Fortfahren:
fr: Vous vous connectez à {host} pour la première fois. Vérifiez l'empreinte du serveur avant de continuer :
zh: 您是第一次连接到 {host}。 连接前请验证服务器指纹：

# sshHostKeyFingerprint
source: Fingerprint:
de: Fingerabdruck:
fr: Empreinte :
zh: 指纹：

# sshHostKeyAccept
source: Trust and connect
de: Vertrauen und verbinden
fr: Faire confiance
zh: 信任并连接

# sshHostKeyReject
source: Reject
de: Ablehnen
fr: Refuser
zh: 拒绝

# sshHostKeyMismatchTitle
source: Warning — Key changed!
de: Warnung — Schlüssel geändert!
fr: Attention — Clé modifiée !
zh: 警告 — 密钥已更改！

# sshHostKeyMismatchMessage
source: The server key for {host} has changed! This could indicate a man-in-the-middle attack. If you did not change the server configuration, reject this connection.
de: Der Serverschlüssel für {host} hat sich geändert! Dies könnte auf einen Man-in-the-Middle-Angriff hindeuten. Wenn Sie die Serverkonfiguration nicht geändert haben, lehnen Sie diese Verbindung ab.
fr: La clé du serveur {host} a changé ! Cela pourrait indiquer une attaque de type man-in-the-middle. Si vous n'avez pas modifié la configuration du serveur, refusez cette connexion.
zh: 服务器 {host} 的密钥已更改！ 这可能表示中间人攻击。如果您没有更改服务器配置，请拒绝此连接。

# rootedDeviceWarning
source: Warning: This device appears to be rooted. SSH key security may be compromised.
de: Warnung: Dieses Gerät scheint gerootet zu sein. Die Sicherheit der SSH-Schlüssel kann beeinträchtigt sein.
fr: Attention : Cet appareil semble rooté. La sécurité des clés SSH peut être compromise.
zh: 警告：此设备似乎已获取Root权限。SSH密钥安全性可能受到影响。

# tooManyAttempts
source: Too many attempts. Try again in {seconds} s
de: Zu viele Versuche. Erneut versuchen in {seconds} s
fr: Trop de tentatives. Réessayez dans {seconds} s

# tryAgainIn
source: Try again in {seconds} s
de: Erneut versuchen in {seconds} s
fr: Réessayez dans {seconds} s

# sshConnectionFailed
source: Could not connect. Check the server address.
fr: Connexion impossible. Vérifiez l'adresse du serveur.

# sshAuthFailed
source: Authentication failed. Check your SSH key.
fr: Authentification échouée. Vérifiez votre clé SSH.

# sshKeyNotConfigured
source: No SSH key configured for this host.
fr: Aucune clé SSH configurée pour cet hôte.

# sshTimeout
source: Connection timed out.
fr: Délai d'attente dépassé.

# sshHostUnreachable
source: Server unreachable. Check Tailscale.
fr: Serveur injoignable. Vérifiez Tailscale.

source: Connection lost
fr: Connexion perdue

# biometricReason
source: Unlock ChillShell to access your SSH sessions
fr: Déverrouillez ChillShell pour accéder à vos sessions SSH

# biometricFingerprint
source: Fingerprint
fr: Empreinte digitale

# biometricGeneric
source: Biometrics
fr: Biométrie

source: Local shell error
fr: Erreur du shell local

# reconnectingAttempt
source: Reconnecting... (attempt {current}/{max})
fr: Reconnexion... (tentative {current}/{max})

source: Unexpected error
fr: Erreur inattendue

# allowScreenshots
source: Screenshots
fr: Captures d'écran

# allowScreenshotsWarning
source: When enabled, screenshots and screen recording are allowed. Be careful not to share sensitive information (SSH keys, passwords, server addresses).
fr: Lorsque activé, les captures d'écran et l'enregistrement d'écran sont autorisés. Attention à ne pas partager d'informations sensibles (clés SSH, mots de passe, adresses serveurs).

source: Rename
fr: Renommer

# renameDialogHint
source: New name
fr: Nouveau nom

source: Name cannot be empty
fr: Le nom ne peut pas être vide

source: Terminal
zh: 终端

source: Port
zh: 端口

source: minutes
de: Minuten
zh: 分钟

source: WOL START
zh: WOL启动

# terminalTab
source: Terminal {number}
zh: 终端 {number}

source: OK
zh: 确定

# sshKeyTypeLabel
source: Type: {type}
de: Typ: {type}
zh: 类型：{type}

# autoDetect
source: Auto
de: Automatisch
zh: 自动

# wolMacConfigTitle
source: Configuration
de: Konfiguration
zh: 配置

# sshHostKeyType
source: Type: {type}
de: Typ: {type}
zh: 类型：{type}
